#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	int a, b;
	double c, d;
	cout << "Введите два целых числа\n\n";
	cin >> a >> b;
	cout << "\n" << a << " + " << b << " = " << a + b << "\n";
	cout << a << " - " << b << " = " << a - b << "\n";
	cout << a << " * " << b << " = " << a * b << "\n";
	cout << a << " / " << b << " = " << a / b << "\n\n";
	cout << "Введите два вещественных числа\n\n";
	cin >> c >> d;
	cout << "\n" << c << " + " << d << " = " << c + d << "\n";
	cout << c << " - " << d << " = " << c - d << "\n";
	cout << c << " * " << d << " = " << c * d << "\n";
	cout << c << " / " << d << " = " << c / d << "\n\n";
	cout << "Введите целое и вещественное числа\n\n";
	cin >> a >> d;
	cout << "\n" << a << " + " << d << " = " << a + d << "\n";
	cout << a << " - " << d << " = " << a - d << "\n";
	cout << a << " * " << d << " = " << a * d << "\n";
	cout << a << " / " << d << " = " << a / d << "\n\n";
	cout << "Итак, при делении целоых чисел не нацело, результат округляется в меньшую сторону,\nоднако при делении целого числа на вещественное, выводится десятичная дробь\n";
}